doublePendulum/doublePendulum/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (-2.0 -0.01 -1)
    ( 2.0 -0.01 -1)
    ( 2.0  0.01 -1)
    (-2.0  0.01 -1)
    (-2.0 -0.01  1)
    ( 2.0 -0.01  1)
    ( 2.0  0.01  1)
    (-2.0  0.01  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 1 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    wall
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (1 5 4 0)
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
