doublePendulum/doublePendulum/0.orig/U
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
FoamFile
{
    version    2.0;
    format    ascii;
    class    volVectorField;
    object    U;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
dimensions    [ 0 1 -1 0 0 0 0 ];
internalField    uniform (0 0 0);
boundaryField
{
    wall
    {
        type    noSlip;
    }

    box1
    {
        type    noSlip;
    }

    box2
    {
        type    noSlip;
    }

}

