doublePendulum/doublePendulum/0.orig/p
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
FoamFile
{
    version    2.0;
    format    ascii;
    class    volScalarField;
    object    p;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
dimensions    [ 0 2 -2 0 0 0 0 ];
internalField    uniform 5;
boundaryField
{
    wall
    {
        type    zeroGradient;
    }

    box1
    {
        type    fixedValue;
        value   uniform 10;
    }

    box2
    {
        type    fixedValue;
        value   uniform 0;
    }

}

