doublePendulum/doublePendulum/0.orig/pointDisplacement
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
FoamFile
{
    version    2.0;
    format    ascii;
    class    pointVectorField;
    object    pointDisplacement;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
dimensions    [ 0 1 0 0 0 0 0 ];
internalField    uniform (0 0 0);
boundaryField
{
    wall
    {
        type    fixedValue;
        value    uniform (0 0 0);
    }

    box1
    {
        type    calculated;
        value    uniform (0 0 0);
    }

    box2
    {
        type    calculated;
        value    uniform (0 0 0);
    }

}

