doublePendulum/doublePendulum/system/fvSchemes
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
FoamFile
{
	version    2.0;
	format    ascii;
	class    dictionary;
	object    fvSchemes;
}

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ddtSchemes
{
	default    Euler;
}

gradSchemes
{
	default    Gauss linear;
}

divSchemes
{
	default    Gauss linear;
}

laplacianSchemes
{
	default    Gauss linear corrected;
}

interpolationSchemes
{
	default    linear;
}

snGradSchemes
{
	default    corrected;
}

wallDist
{
	method    meshWave;
}

